Autodesk.Revit.DB.ExportLayerInfo.SetCutLayerModifiers(System.Collections.Generic.IList{Autodesk.Revit.DB.LayerModifier})
Sets a cut layer modifier array to the layer info.
cutLayermodifiers:
The cut layer modifier array.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.ExportLayerInfo.SetLayerModifiers(System.Collections.Generic.IList{Autodesk.Revit.DB.LayerModifier})
Sets a project layer modifier array to the layer info.
layermodifiers:
The project layer modifier array.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.ExportLayerInfo.GetCutLayerModifiers
Gets all the cut layer modifiers from the layer info.
Returns:
The cut layer modifier array.
Since:
2014

Autodesk.Revit.DB.ExportLayerInfo.GetLayerModifiers
Gets all the project layer modifiers from the layer info.
Returns:
The project layer modifier array.
Since:
2014

Autodesk.Revit.DB.ExportLayerInfo.ClearCutLayerModifiers
Clears all the cut layer modifiers stored in the layer info.
Since:
2014

Autodesk.Revit.DB.ExportLayerInfo.ClearLayerModifiers
Clears all the project layer modifiers stored in the layer info.
Since:
2014

Autodesk.Revit.DB.ExportLayerInfo.RemoveCutLayerModifier(Autodesk.Revit.DB.LayerModifier)
Removes a cut layer modifier from the layer info.
layerModifier:
The cut layer modifier.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.ExportLayerInfo.RemoveLayerModifier(Autodesk.Revit.DB.LayerModifier)
Removes a project layer modifier from the layer info.
layerModifier:
The project layer modifier.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.ExportLayerInfo.AddCutLayerModifier(Autodesk.Revit.DB.LayerModifier)
Adds a cut layer modifier to the layer info.
layerModifier:
The cut layer modifier.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The separator string contains one or more prohibited characters.
-or-
The modifier type already exists in the cut layer info.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.ExportLayerInfo.AddLayerModifier(Autodesk.Revit.DB.LayerModifier)
Adds a project layer modifier to the layer info.
layerModifier:
The project layer modifier.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The separator string contains one or more prohibited characters.
-or-
The modifier type already exists in the layer info.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.ExportLayerInfo.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.ExportLayerInfo.CutColorNumber
The cut color number stored in value.
Since:
2014

Autodesk.Revit.DB.ExportLayerInfo.ColorNumber
The color number stored in value.
Since:
2014

Autodesk.Revit.DB.ExportLayerInfo.CutLayerName
The cut layer name stored in value.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.ExportLayerInfo.LayerName
The layer name stored in value.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.ExportLayerInfo.ColorName
The color name stored in value.
For IFC export, the naming is to match the "colornumber" setting -- really, this stores a string
that generates the colorNumber (for formats that don't use the color but need a second entry.)
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.ExportLayerInfo.CategoryType
The category type which this layer belongs to.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2014

Autodesk.Revit.DB.ExportLayerInfo.#ctor
Constructs a new ExportLayerInfo with default values.
Since:
2014

Autodesk.Revit.DB.ExportLayerInfo
A value used to represent the info stored in the Autodesk.Revit.DB.ExportLayerTable.
Since:
2014